In [1]:
#Make an example similar to input
import pandas as pd
import numpy as np
import string
col_num = 4
df = pd.DataFrame(np.random.random((11,col_num))*100, columns=list(string.ascii_uppercase)[:col_num]) #columns letters of alphabet based on https://stackoverflow.com/a/48911848/8508004
list = []
for i in range(1, df.shape[0] + 1): # gets the length of the DataFrame.
    list.append(f'Sample{i:03d}') # Using f-string for format and 03d for leading zeros.
df['A'] = list
df["D"] = 0
df

            A          B          C  D
0   Sample001  10.050909  47.809380  0
1   Sample002  87.467438  16.073652  0
2   Sample003  52.592303  84.550920  0
3   Sample004   7.191352  97.149418  0
4   Sample005   7.247809  94.281273  0
5   Sample006  92.237988  67.519471  0
6   Sample007  18.459786  91.910198  0
7   Sample008  49.190417  14.685278  0
8   Sample009  75.550560  51.601866  0
9   Sample010  96.480584  73.379443  0
10  Sample011  94.653988  22.448392  0

In [2]:
df.iloc[0:3]

           A          B          C  D
0  Sample001  10.050909  47.809380  0
1  Sample002  87.467438  16.073652  0
2  Sample003  52.592303  84.550920  0